namespace Kogane
{
    /// <summary>
    /// ビルドコマンドのインターフェイス
    /// </summary>
    public interface IBuildCommand
    {
        //==============================================================================
        // プロパティ
        //==============================================================================
        /// <summary>
        /// タグを返します
        /// </summary>
        string Tag { get; }

        //==============================================================================
        // 関数
        //==============================================================================
        /// <summary>
        /// 実行する時に呼び出されます
        /// </summary>
        BuildCommandResult Run();

        /// <summary>
        /// 後始末する時に呼び出されます
        /// </summary>
        void CleanUp();
    }
}